/*
冒险岛(079)游戏服务端
 脚本：玩具塔奖励领取
 */



var status;
var 玩具通关经验 = 4000;
var 积分 = 1;

function start() {
    status = -1;
    action(1, 0, 0);
}
//副本通关奖励区域
/*
cm.概率给物品(物品代码，固定数量，概率,备注)；
cm.概率给物品2(物品代码，随机数量，概率,备注)；
*/
function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    }
    if (mode == 1)
        status++;
    else
        status--;
    if (status == 0) {
        cm.sendNext("请确认你的道具栏有没有满,满了领不到东西喔。");
    } else if (status == 1) {
		//玩具盛产金属，恩
		cm.概率给物品2(4002001,3,80,"蓝蜗牛邮票");
		cm.概率给物品2(4170007,1,50,"飞天猪的蛋");
		cm.概率给物品2(4000487,1,50,"暗影币");
		cm.概率给物品2(4310022,2,100,"樱花节纪念币");
		cm.概率给物品2(4010000,3,60,"青铜母矿");
		cm.概率给物品2(4010001,3,60,"钢铁母矿");
		cm.概率给物品2(4010002,3,60,"锂矿石母矿");
		cm.概率给物品2(4010003,3,60,"朱矿石母矿");
		cm.概率给物品2(4010004,3,60,"银的母矿");
		cm.概率给物品2(4010005,3,60,"紫矿石母矿");
		cm.概率给物品2(4010006,3,60,"黄金母矿");
		cm.概率给物品2(4010007,3,60,"锂母矿");
		
		
		//记录通关信息
		cm.给经验(cm.getLevel()*玩具通关经验);
		cm.getPlayer().endPartyQuest(1202);
	    cm.setBossRankCount("玩具塔",1);
	    cm.setBossLog("玩具塔");
		cm.gainzdjf(积分);//组队任务积分
        cm.worldMessage(2, "[副本-玩具塔] : 恭喜 " + cm.getPlayer().getName() + " 完成玩具塔副本。");
        cm.warp(221024500);
        cm.dispose();
    }
}
