/*
 QILIN冒险岛服务端
 脚本：藏宝阁
 脚本：超级 数组内容
 时间：2019.11.5
*/

var 充值网站 = "https://pay.6799wan.com/Payment/Service/db599be3788a85cba6311b70b4d2";
var  数组内容 = new Array(
//奖励的和奖励数量必须一致，需要材料和材料数量必须一致，否则会出错！
//
//设置属性格式：合成装备,力量,敏捷,运气,智力,HP,MP,物攻,魔攻,物防,魔防,回避,命中,跳跃,速度



//透明装备
[
[[200000]/**/,[1003276,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["蓝心透明帽子"]/**/],
[[200000]/**/,[1003271,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["红心透明帽子"]/**/],
[[200000]/**/,[1102039,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["透明披风"]/**/],
[[200000]/**/,[1082102,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["透明手套"]/**/],
[[200000]/**/,[1012057,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["透明面具"]/**/],
[[200000]/**/,[1072153,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["透明鞋子"]/**/],
[[200000]/**/,[1022048,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["透明眼镜"]/**/],
[[200000]/**/,[1092064,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["透明盾牌"]/**/],
[[200000]/**/,[1702224,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["透明装备"]/**/]

],

//奇珍异宝
[
//[[10000]/**/,[4021021,1],["贤者之石 "]/**/],
[[1000]/**/,[4032226,1],["黄金猪猪 "]/**/]
],


//勋章类
[
[[500000]/**/,[1142893,25,25,25,25,500,500,25,25,200,200,100,100,10,10],["飞龙在天派门徒	"]/**/],
[[500000]/**/,[1142894,25,25,25,25,500,500,25,25,200,200,100,100,10,10],["虎啸九天派门徒	"]/**/],
[[500000]/**/,[1142802,25,25,25,25,500,500,25,25,200,200,100,100,10,10],["星之大陆旅行者	"]/**/],
[[500000]/**/,[1142803,25,25,25,25,500,500,25,25,200,200,100,100,10,10],["安德洛墨达之贵宾	"]/**/]
],


//时装类
[
[[200000]/**/,[1042285,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["拼色点点T恤	"]/**/],
[[200000]/**/,[1042132,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["爱情海蓝T恤	"]/**/],
[[200000]/**/,[1042222,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["柠檬色可爱T恤	"]/**/],
[[200000]/**/,[1042344,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["中式祥云T恤"]/**/],
[[200000]/**/,[1042144,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["我最IN－T恤"]/**/],
[[200000]/**/,[1060188,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["白色夏日短裤	"]/**/],
[[200000]/**/,[1061212,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["白色夏日短裙	"]/**/],
[[200000]/**/,[1062156,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["紫色马赛克短裤"]/**/],
[[200000]/**/,[1062204,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["彩糖短裤		"]/**/],
[[200000]/**/,[1062203,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["中式祥云短裤"]/**/],
[[200000]/**/,[1062232,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["中式祥云短裙	"]/**/]
],



[
[[500000]/**/,[1051431,25,25,25,25,500,500,25,25,200,200,100,100,10,10],["恋爱女孩信使"]/**/],
[[500000]/**/,[1050361,25,25,25,25,500,500,25,25,200,200,100,100,10,10],["恋爱男孩信使"]/**/],
[[500000]/**/,[1051180,25,25,25,25,500,500,25,25,200,200,100,100,10,10],["水兵服"]/**/],
[[500000]/**/,[1050152,25,25,25,25,500,500,25,25,200,200,100,100,10,10],["水兵服"]/**/],
[[500000]/**/,[1051426,25,25,25,25,500,500,25,25,200,200,100,100,10,10],["暗夜高校服"]/**/],
[[500000]/**/,[1050356,25,25,25,25,500,500,25,25,200,200,100,100,10,10],["暗夜高校服"]/**/],
[[500000]/**/,[1051410,25,25,25,25,500,500,25,25,200,200,100,100,10,10],["森林露营服"]/**/],
[[500000]/**/,[1050341,25,25,25,25,500,500,25,25,200,200,100,100,10,10],["森林露营服"]/**/],
[[500000]/**/,[1052911,25,25,25,25,500,500,25,25,200,200,100,100,10,10],["水晶喵喵连衣裙"]/**/],
[[500000]/**/,[1052910,25,25,25,25,500,500,25,25,200,200,100,100,10,10],["水晶喵喵全身服"]/**/]

],


[
[[500000]/**/,[1032241,15,15,15,15,300,300,15,15,100,100,50,50,10,10],["魅惑耳环-非点装"]/**/],
[[500000]/**/,[1022246,15,15,15,15,300,300,15,15,100,100,50,50,10,10],["卡米拉眼镜-非点装"]/**/],
[[500000]/**/,[1012319,15,15,15,15,300,300,15,15,100,100,50,50,10,10],["8周年点点红-非点装"]/**/],
[[500000]/**/,[1132258,15,15,15,15,300,300,15,15,100,100,50,50,10,10],["完美点绝对腰带-非点装"]/**/]

],


//超级戒指
[
[[200000]/**/,[1112140,10,10,10,10,100,100,10,10,50,50,20,20,10,10],["白银VIP名片戒子"]/**/],
[[200000]/**/,[1112247,10,10,10,10,100,100,10,10,50,50,20,20,10,10],["白银VIP聊天戒子"]/**/],
[[500000]/**/,[1112915,15,15,15,15,300,300,15,15,100,100,50,50,10,10],["蓝调戒子"]/**/]

],


//超级坐骑
[
[[500000]/**/,[1902032,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇"]/**/],
[[500000]/**/,[1912025,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1902052,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1912045,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1902055,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1912048,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1902336,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1912336,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1902339,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1912339,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1902342,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1912342,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1902351,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1912351,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1902401,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1912401,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1902402,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1912402,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],

]










);
var dxsz = new Array("一","二","三","四","五","六","七","八","九","十","十一","十二","十三");

var 兔子1 = "#fEffect/CharacterEff/1082565/0/0#";
var 兔子2 = "#fEffect/CharacterEff/1082565/2/0#";
var 兔子3 = "#fEffect/CharacterEff/1082565/4/0#";
var 表情高兴 = "#fUI/GuildBBS/GuildBBS/Emoticon/Basic/2#";
var 小金币 = "#fUI/UIWindow.img/Item/BtCoin/normal/0#";
var 点券图标 = "#fUI/CashShop/CashItem/0#";
var sels;
var status = -1;
var lbtb = "#v5680388#";
var 白金礼包 = "#fItem/Special/0910.img/9101038/icon#";
var M14 = "#fEffect/CharacterEff/1112925/0/0#";
// true 开启
// false 关闭
function start() {
	
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else if (mode == 0) {
        //status--;
		cm.dispose();
		return;
    } else {
        cm.dispose();
        return;
    }
    if (status == 0) {
		var msg = "";	
        msg += "\t\t\t  #e#b"+表情高兴+"  藏 点 宝 阁  "+表情高兴+"#k#n\r\n\r\n";
		
        msg += "#L1000#"+点券图标+"#d点卷余额："+cm.getPlayer().getCSPoints(1)+"  [#b点击充值点卷#d]#l\r\n\r\n"             		
		
        msg += "#L1#"+M14+"奇珍异宝#l\r\n"
		
		//msg += "#L3#"+M14+"精美时装#l  #L4#"+M14+"时尚套装#l  #L5#"+M14+"超级饰品#l\r\n"
		
		//msg += "#L6#"+M14+"精美戒子#l  #L7#"+M14+"珍贵坐骑#l #L0#"+M14+"热卖商品#l #L2#"+M14+"精品勋章#l\r\n"
		
        cm.sendSimple("" + msg + "");
		
	} else if (status == 1) {	
        if (selection == 1000) {
			cm.openWeb(充值网站); //打开网页
			cm.playerMessage(5, "正在打开充值网站！如果没有弹出充值网站请联系GM1"); //个人看见的对话 5红色字 6蓝色字 1为弹窗
			cm.dispose();
			return;			
		}
		
		flx = selection;
		
		
		var msg = "";	
        msg += "\t\t\t  #e#b"+表情高兴+"  藏 点 宝 阁  "+表情高兴+"#k#n\r\n\r\n";
		
        msg += "#L1000#"+点券图标+"#d点卷余额："+cm.getPlayer().getCSPoints(1)+"  [#b点击充值点卷#d]#l\r\n\r\n"             		
		// for (var i = 0; i <  数组内容[flx].length; i++) {
		// msg += "测试值："+数组内容[flx][i][1][0]+"\r\n"
		// }
		
		for (var i = 0; i <  数组内容[flx].length; i++) {			         
			msg += "#L"+i+"##d#v"+数组内容[flx][i][1][0]+"##t"+数组内容[flx][i][1][0]+"##b[查看详情]\r\n"
            msg += "   "+点券图标+"#d售价："+数组内容[flx][i][0][0]+" 点卷        #l\r\n\r\n"					
        }

		
        cm.sendSimple("" + msg + "");
    } else if (status == 2) {
		if (selection == 1000) {
			cm.openWeb(充值网站); //打开网页
			cm.playerMessage(5, "正在打开充值网站！如果没有弹出充值网站请联系GM1"); //个人看见的对话 5红色字 6蓝色字 1为弹窗
			cm.dispose();
			return;
			
		}
		
		
		检测材料 = false;
		组位 = selection;
		

        sels = selection;
        var msg = "";		
            item = cm.getEquip(数组内容[flx][组位][1][0]).copy();//从WZ获取装备属性
			
			if (数组内容[flx][组位][1][5] == null ) {
			wplx = true;
			msg += "#e#b#i"+ 数组内容[flx][组位][1][0]+":##z"+ 数组内容[flx][组位][1][0]+"#   #r是否购买？#n\r\n"
				
			
			msg += ""+数组内容[flx][组位][2][0]+"\r\n"
			msg += "  #b数量："+数组内容[flx][组位][1][1]+"\r\n"			
			} else {
			wplx = false;	
			
			msg += "#e#b#v"+ 数组内容[flx][组位][1][0]+"##t"+ 数组内容[flx][组位][1][0]+"#   #r是否购买？#n\r\n"
			
			msg += "#b物品属性详情\r\n"
			
			
			if (数组内容[flx][组位][1][1] > 0 || item.getStr() ) {
			if (数组内容[flx][组位][1][1] > 0  ) {
			item.setStr(数组内容[flx][组位][1][1]);	
			}
			msg += "#d力量:"+ item.getStr() +" "			
			}
			
			
						
			if (数组内容[flx][组位][1][2] > 0 || item.getDex() ) {
			if (数组内容[flx][组位][1][2] > 0  ) {
			item.setDex(数组内容[flx][组位][1][2]);
			}
			msg += "#d敏捷:"+ item.getDex() +" "			
			}
			
			if (数组内容[flx][组位][1][3] > 0 || item.getInt() ) {
			if (数组内容[flx][组位][1][3] > 0){
			item.setInt(数组内容[flx][组位][1][3]);
			}
			msg += "#d智力:"+ item.getInt() +" "			
			}
			
			if (数组内容[flx][组位][1][4] > 0 || item.getLuk() ) {
			if (数组内容[flx][组位][1][4] > 0) {
			item.setLuk(数组内容[flx][组位][1][3]);
			}
			msg += "#d运气:"+ item.getLuk() +"\r\n"			
			}
			
			if (数组内容[flx][组位][1][5] > 0 || item.getHp() ) {
			if (数组内容[flx][组位][1][5] > 0){
			item.setHp(数组内容[flx][组位][1][5]);
			}
			msg += "#dHP:"+ item.getHp() +" "
			
			}
			if (数组内容[flx][组位][1][6] > 0 || item.getMp() ) {
			if (数组内容[flx][组位][1][6] > 0){
			item.setMp(数组内容[flx][组位][1][6]);
			}
			msg += "#dMP:"+ item.getMp() +" "
			
			}
			if (数组内容[flx][组位][1][7] > 0 || item.getWatk() ) {
			if (数组内容[flx][组位][1][7] > 0){
			item.setWatk(数组内容[flx][组位][1][7]);
			}
			msg += "#d物攻:"+ item.getWatk() +" "
			
			}
			
			
			if (数组内容[flx][组位][1][8] > 0 || item.getMatk() ) {
			if (数组内容[flx][组位][1][8] > 0){
			item.setMatk(数组内容[flx][组位][1][8]);
			}
			msg += "#d魔攻:"+ item.getMatk() +"\r\n"
			
			}
			
			if (数组内容[flx][组位][1][9] > 0 || item.getWdef() ) {			
			if (数组内容[flx][组位][1][9] > 0){
			item.setWdef(数组内容[flx][组位][1][9]);
			}
			msg += "#d物防:"+ item.getWdef() +" "
			}
			
			
			
			if (数组内容[flx][组位][1][10] > 0 || item.getMdef() ) {
			if (数组内容[flx][组位][1][10] > 0){
			item.setMdef(数组内容[flx][组位][1][10]);
			}
			msg += "#d魔防:"+ item.getMdef() +" "
			
			}
			if (数组内容[flx][组位][1][11] > 0 || item.getAvoid() ) {
			if (数组内容[flx][组位][1][11] > 0){
			item.setAvoid(数组内容[flx][组位][1][11]);
			}
			msg += "#d回避:"+ item.getAvoid() +" "
			
			}
			
			if (数组内容[flx][组位][1][12] > 0 || item.getAcc() ) {
			if (数组内容[flx][组位][1][12] > 0){
			item.setAcc(数组内容[flx][组位][1][12]);
			}
			msg += "#d命中:"+ item.getAcc() +" \r\n"
			
			}
			
			if (数组内容[flx][组位][1][13] > 0 || item.getJump() ) {
			if (数组内容[flx][组位][1][13] > 0){
			item.setJump(数组内容[flx][组位][1][13]);
			}
			msg += "#d跳跃:"+ item.getJump() +" "
			
			}
			if (数组内容[flx][组位][1][14] > 0 || item.getSpeed() ) {
			if (数组内容[flx][组位][1][14] > 0){
			item.setSpeed(数组内容[flx][组位][1][14]);
			}
			msg += "#d速度:"+ item.getSpeed() +" \r\n"
			
			}						
													
			
			msg += "\r\n#b说明："+数组内容[flx][组位][2][0]+"\r\n"
			}
										           				
			msg += ""+点券图标+"#b售价："+数组内容[flx][组位][0][0]+"\r\n"
				
        cm.sendYesNo(msg);
    } else if (status == 3) {
		
		if (cm.getPlayer().getCSPoints(1) < 数组内容[flx][组位][0][0]) {
		cm.sendOk("点卷不足无法购买！");	
        cm.dispose();
		} else if (!cm.canHold(数组内容[flx][组位][1][0],1)) {     
		cm.sendOk("背包空间不足哦！或者已经有一件了...");	
        cm.dispose();
		} else if (!cm.canHold()) {     
		cm.sendOk("所有背包空间必须留出一个空间");	
        cm.dispose();
		} else {
		cm.gainNX(-数组内容[flx][组位][0][0]);
		if (wplx) {
		cm.gainItem(数组内容[flx][组位][1][0],数组内容[flx][组位][1][1]);
		cm.sendOk("成功购买：#v"+数组内容[flx][组位][1][0]+"##t"+数组内容[flx][组位][1][0]+"# X "+数组内容[flx][组位][1][1]+"");
		//cm.gainItem(数组内容[flx][组位][1][0],数组内容[flx][组位][1][1], "藏宝阁", 1," X "+数组内容[flx][组位][1][1]+"  获得了非常不错的道具");
		} else {		
		cm.sendOk("成功购买：#v"+数组内容[flx][组位][1][0]+"##t"+数组内容[flx][组位][1][0]+"#");	
		//cm.全服黄色喇叭("【藏宝阁】[" + cm.getPlayer().getName() + "]","获得了一些不错的装备...",1,item.getPosition")
		}
		
		
        cm.dispose();
        return;
        }		
        cm.dispose();
        return;
    } else {
        cm.sendNext("#r发生错误: mode : " + mode + " status : " + status);
        cm.dispose();
    }
}
