package fumo;

public class FumoSkill {

    /**
     * <强攻[1]>:增加对普通怪物的伤害
     * <超强攻[2]>:增加对高级怪物的伤害
     * <战争意志[3]>:增加对所有怪物的伤害
     * <鹰眼[4]>:一定几率秒杀普通怪物
     * <锐眼[5]>:一定几率秒杀高级怪物
     * <谢幕[6]>:一定几率秒杀所有怪物
     * <兵不血刃[7]>:增加秒杀值
     * <致命打击[8]>:一定概率让怪物血量只剩1
     * <蒙蔽[9]>:攻击怪物时，一定机率怪物不会有仇恨
     * <追击[10]>:攻击时附加一定量真实伤害
     * <神圣执法[11]>:攻击不死族增加额外最终伤害
     * <致残[12]>:攻击不可移动怪物时增加基础伤害
     * <坚韧[21]>:减少受到的伤害(百分比)
     * <坚不可摧[22]>:减少受到的伤害(固定数值)
     * <顽固[23]>:受到的伤害大于你最大生命值60%时，会减少N%的伤害>
     * <未卜先知[24]>:用超级药水抵消受到的伤害
     * <幸运狩猎[31]>:增加打怪经验
     * <苦中作乐[32]>:被诅咒增加5倍经验值
     * <闲来好运[33]>:增加泡点经验
     * <财源滚滚[34]>:增加泡点金币
     * <异常抗性[100]>:减少异常状态持续时间
     * <异常免疫[101]>:一定机率免疫异常状态
     * <伺机待发[200]>:使用BUFF技能一定几率清空所有冷却
     * <茁壮生命[300]>:升级时，额外提升N点MaxHP
     * <茁壮魔力[301]>:升级时，额外提升N点MaxMP
     * <茁壮生成[302]>:升级时，额外提升N点MaxHP,MaxMP
     * <稳如泰山[400]>:被攻击时，一定机率发动稳如泰山
     * <愤怒之火[401]>:被攻击时，一定机率发动愤怒之火
     * <训练有方[500]>: >
     */
    public static int FM(String a) {

        if (null != a) {
            switch (a) {
                //增加对普通怪物的伤害
                case "强攻":
                    return 1;

                //增加对高级怪物的伤害
                case "超强攻":
                    return 2;

                //增加对所有怪物的伤害
                case "战争意志":
                    return 3;

                //一定几率秒杀普通怪物
                case "鹰眼":
                    return 4;

                //一定几率秒杀高级怪物
                case "锐眼":
                    return 5;

                //一定几率秒杀所有怪物
                case "谢幕":
                    return 6;

                //增加秒杀值
                case "兵不血刃":
                    return 7;

                //一定概率让怪物血量只剩下1
                case "致命打击":
                    return 8;

                //攻击怪物时，一定机率怪物不会有仇恨
                case "蒙蔽":
                    return 9;

                //攻击怪物时，一定机率怪物不会有仇恨
                case "追击":
                    return 10;

                //攻击时附加一定量真实伤害
                case "坚韧":
                    return 21;

                //减少受到的伤害(固定数值)
                case "坚不可摧":
                    return 22;

                //受到的伤害大于你最大生命值60%时，会减少N%的伤害
                case "顽固":
                    return 23;

                //用超级药水抵消受到的伤害
                case "未卜先知":
                    return 24;

                //增加打怪经验
                case "幸运狩猎":
                    return 31;

                //被诅咒增加5倍经验值
                case "苦中作乐":
                    return 32;

                //增加泡点经验
                case "闲来好运":
                    return 33;

                //增加泡点金币
                case "财源滚滚":
                    return 34;

                //减少异常状态持续时间
                case "异常抗性":
                    return 100;

                //一定几率免疫异常状态
                case "异常免疫":
                    return 101;

                //使用BUFF技能一定几率清空所有冷却
                case "伺机待发":
                    return 200;

                //升级时，额外提升N点HP
                case "茁壮生命":
                    return 300;

                //升级时，额外提升N点MP
                case "茁壮魔力":
                    return 301;

                //升级时，额外提升N点MPP
                case "茁壮生长":
                    return 302;

                //升级时，额外提升等级，但是不会增加升级属性
                case "拔苗助长":
                    return 303;

                //被攻击时，一定机率发动稳如泰山
                case "稳如泰山":
                    return 400;

                //被攻击时，一定机率发动愤怒之火
                case "愤怒之火":
                    return 401;

                //
                case "训练有方":
                    return 500;
                //
                case "训练有素":
                    return 501;

                case "迅捷突袭":
                    return 502;

                case "心有灵犀":
                    return 503;

                //根据枫叶增加伤害
                case "落叶斩":
                    return 4211002;
                //根据枫叶增加伤害
                case "多重飞镖":
                    return 4111005;

                case "斗气集中":
                    return 1111002;

                case "属性攻击":
                    return 1211002;

                case "龙之献祭":
                    return 1311005;

                case "末日烈焰":
                    return 2111002;

                case "落雷枪":
                    return 2211003;

                case "圣光":
                    return 2311004;

                case "箭扫射1":
                    return 3111006;

                case "箭扫射2":
                    return 3211006;

                case "超人变身":
                    return 5111005;

                case "双枪喷射":
                    return 5211004;

                default:
                    break;
            }
        }
        return 0;
    }

}
